index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Notes about programming tools</title>
<!-- 2015-06-16 Τρι 04:12 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Georgios Diapoulis" />
</head>
<body>
<div id="content">
<h1 class="title">Notes about programming tools</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. About</a></li>
<li><a href="#sec-2">2. Github</a>
<ul>
<li><a href="#sec-2-1">2.1. Git locally</a></li>
<li><a href="#sec-2-2">2.2. Git publicly</a></li>
<li><a href="#sec-2-3">2.3. Using Magit</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Orgmode</a>
<ul>
<li><a href="#sec-3-1">3.1. Org-tables</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Emacs</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> About</h2>
<div class="outline-text-2" id="text-1">
<p>
These are personal notes, if anyone finds this documentation helpful I will be glad too.  I adopt this template from <a href="http://pages.sachachua.com/.emacs.d/Sacha.html">Sacha Chua</a>, and it is written in <a href="http://orgmode.org/">Orgmode</a>.  You can find the orgmode and html files <a href="https://github.com/gewhere/gewhere.github.io">here</a>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Github</h2>
<div class="outline-text-2" id="text-2">
<p>
I am learning how to use github, it's pretty handy, just needs some time and repetitive practice.  The basic steps are below:
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Git locally</h3>
<div class="outline-text-3" id="text-2-1">
<p>
You can use git only locally, though one of the main concept behind git and version control systems is that of collaborative coding.
</p>

<div class="org-src-container">

<pre class="src src-sh">git init                        # initialize a folder .git/
# create a file
touch newfile                   # Ctrl+D to save and exit
git status                      # now newfile is untracked
git add newfile                 # to bring file in the staged level
git commit -m 'Initial commit'  # to make file ready for push
</pre>
</div>

<p>
Branching is a core concept for handling big programming projects.
</p>

<div class="org-src-container">

<pre class="src src-sh">git brach NewBranch     # creates a new branch
git branch              # returns the working branch
git checkout NewBranch  # you are now in the NewBranch
touch newfile           # create a newfile in the NewBranch
                        # this file does not exists in the working directory
                        # unless you 'git merge'
git checkout master     # the master branch is by default the branch that git initialise
git merge NewBranch     # at this point the newfile appears
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Git publicly</h3>
<div class="outline-text-3" id="text-2-2">
<p>
When you <code>git clone</code> a repository to your hard disc, you clone this from a <i>remote</i>.
</p>

<div class="org-src-container">

<pre class="src src-sh">git remote              # this should return 'origin'
git remote -v           # returns the online repository
git push origin master  # git asks for credentials
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Using Magit</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Magit is an emacs package with which you can handle git more interactively.  With following steps you can push your code on github. With <code>M-x magit-status</code> magit opens a buffer which tracks your activity.  In this buffer you can see your local path to the working directory, your remotes, and the last commit online (<code>Head</code>).
</p>

<p>
At the top of your files in the magit's buffer there is a button like text region which says either <code>Unstaged changes</code> for files that are untracked, either <code>Staged Changes</code> for files that are in the staged level, or <code>Unpushed commits</code>.
</p>
<pre class="example">
M-x magit-status
s =&gt; to stage
c c =&gt; to commit
P P =&gt; to push
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Orgmode</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Org-tables</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">do</th>
<th scope="col" class="right">do#</th>
<th scope="col" class="right">re</th>
<th scope="col" class="right">re#</th>
<th scope="col" class="right">mi</th>
<th scope="col" class="right">fa</th>
<th scope="col" class="right">fa#</th>
<th scope="col" class="right">so</th>
<th scope="col" class="right">so#</th>
<th scope="col" class="right">la</th>
<th scope="col" class="right">la#</th>
<th scope="col" class="right">ti</th>
<th scope="col" class="right">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">6.35</td>
<td class="right">2.23</td>
<td class="right">3.48</td>
<td class="right">2.33</td>
<td class="right">4.38</td>
<td class="right">4.09</td>
<td class="right">2.52</td>
<td class="right">5.19</td>
<td class="right">2.39</td>
<td class="right">3.66</td>
<td class="right">2.29</td>
<td class="right">2.88</td>
<td class="right">41.79</td>
</tr>
</tbody>
</table>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">la</th>
<th scope="col" class="right">la#</th>
<th scope="col" class="right">ti</th>
<th scope="col" class="right">do</th>
<th scope="col" class="right">do#</th>
<th scope="col" class="right">re</th>
<th scope="col" class="right">re#</th>
<th scope="col" class="right">mi</th>
<th scope="col" class="right">fa</th>
<th scope="col" class="right">fa#</th>
<th scope="col" class="right">so</th>
<th scope="col" class="right">so#</th>
<th scope="col" class="right">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">6.33</td>
<td class="right">2.68</td>
<td class="right">3.52</td>
<td class="right">5.38</td>
<td class="right">2.60</td>
<td class="right">3.53</td>
<td class="right">2.54</td>
<td class="right">4.75</td>
<td class="right">3.98</td>
<td class="right">2.69</td>
<td class="right">3.34</td>
<td class="right">3.17</td>
<td class="right">44.51</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Emacs</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Georgios Diapoulis</p>
<p class="date">Created: 2015-06-16 Τρι 04:12</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
